node {
  name: "load_images/input_producer/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3038
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 3038
          }
        }
        string_val: "../data/target/train_images/0000.png"
        string_val: "../data/target/train_images/0001.png"
        string_val: "../data/target/train_images/0002.png"
        string_val: "../data/target/train_images/0003.png"
        string_val: "../data/target/train_images/0004.png"
        string_val: "../data/target/train_images/0005.png"
        string_val: "../data/target/train_images/0006.png"
        string_val: "../data/target/train_images/0007.png"
        string_val: "../data/target/train_images/0008.png"
        string_val: "../data/target/train_images/0009.png"
        string_val: "../data/target/train_images/0010.png"
        string_val: "../data/target/train_images/0011.png"
        string_val: "../data/target/train_images/0012.png"
        string_val: "../data/target/train_images/0013.png"
        string_val: "../data/target/train_images/0014.png"
        string_val: "../data/target/train_images/0015.png"
        string_val: "../data/target/train_images/0016.png"
        string_val: "../data/target/train_images/0017.png"
        string_val: "../data/target/train_images/0018.png"
        string_val: "../data/target/train_images/0019.png"
        string_val: "../data/target/train_images/0020.png"
        string_val: "../data/target/train_images/0021.png"
        string_val: "../data/target/train_images/0022.png"
        string_val: "../data/target/train_images/0023.png"
        string_val: "../data/target/train_images/0024.png"
        string_val: "../data/target/train_images/0025.png"
        string_val: "../data/target/train_images/0026.png"
        string_val: "../data/target/train_images/0027.png"
        string_val: "../data/target/train_images/0028.png"
        string_val: "../data/target/train_images/0029.png"
        string_val: "../data/target/train_images/0030.png"
        string_val: "../data/target/train_images/0031.png"
        string_val: "../data/target/train_images/0032.png"
        string_val: "../data/target/train_images/0033.png"
        string_val: "../data/target/train_images/0034.png"
        string_val: "../data/target/train_images/0035.png"
        string_val: "../data/target/train_images/0036.png"
        string_val: "../data/target/train_images/0037.png"
        string_val: "../data/target/train_images/0038.png"
        string_val: "../data/target/train_images/0039.png"
        string_val: "../data/target/train_images/0040.png"
        string_val: "../data/target/train_images/0041.png"
        string_val: "../data/target/train_images/0042.png"
        string_val: "../data/target/train_images/0043.png"
        string_val: "../data/target/train_images/0044.png"
        string_val: "../data/target/train_images/0045.png"
        string_val: "../data/target/train_images/0046.png"
        string_val: "../data/target/train_images/0047.png"
        string_val: "../data/target/train_images/0048.png"
        string_val: "../data/target/train_images/0049.png"
        string_val: "../data/target/train_images/0050.png"
        string_val: "../data/target/train_images/0051.png"
        string_val: "../data/target/train_images/0052.png"
        string_val: "../data/target/train_images/0053.png"
        string_val: "../data/target/train_images/0054.png"
        string_val: "../data/target/train_images/0055.png"
        string_val: "../data/target/train_images/0056.png"
        string_val: "../data/target/train_images/0057.png"
        string_val: "../data/target/train_images/0058.png"
        string_val: "../data/target/train_images/0059.png"
        string_val: "../data/target/train_images/0060.png"
        string_val: "../data/target/train_images/0061.png"
        string_val: "../data/target/train_images/0062.png"
        string_val: "../data/target/train_images/0063.png"
        string_val: "../data/target/train_images/0064.png"
        string_val: "../data/target/train_images/0065.png"
        string_val: "../data/target/train_images/0066.png"
        string_val: "../data/target/train_images/0067.png"
        string_val: "../data/target/train_images/0068.png"
        string_val: "../data/target/train_images/0069.png"
        string_val: "../data/target/train_images/0070.png"
        string_val: "../data/target/train_images/0071.png"
        string_val: "../data/target/train_images/0072.png"
        string_val: "../data/target/train_images/0073.png"
        string_val: "../data/target/train_images/0074.png"
        string_val: "../data/target/train_images/0075.png"
        string_val: "../data/target/train_images/0076.png"
        string_val: "../data/target/train_images/0077.png"
        string_val: "../data/target/train_images/0078.png"
        string_val: "../data/target/train_images/0079.png"
        string_val: "../data/target/train_images/0080.png"
        string_val: "../data/target/train_images/0081.png"
        string_val: "../data/target/train_images/0082.png"
        string_val: "../data/target/train_images/0083.png"
        string_val: "../data/target/train_images/0084.png"
        string_val: "../data/target/train_images/0085.png"
        string_val: "../data/target/train_images/0086.png"
        string_val: "../data/target/train_images/0087.png"
        string_val: "../data/target/train_images/0088.png"
        string_val: "../data/target/train_images/0089.png"
        string_val: "../data/target/train_images/0090.png"
        string_val: "../data/target/train_images/0091.png"
        string_val: "../data/target/train_images/0092.png"
        string_val: "../data/target/train_images/0093.png"
        string_val: "../data/target/train_images/0094.png"
        string_val: "../data/target/train_images/0095.png"
        string_val: "../data/target/train_images/0096.png"
        string_val: "../data/target/train_images/0097.png"
        string_val: "../data/target/train_images/0098.png"
        string_val: "../data/target/train_images/0099.png"
        string_val: "../data/target/train_images/0100.png"
        string_val: "../data/target/train_images/0101.png"
        string_val: "../data/target/train_images/0102.png"
        string_val: "../data/target/train_images/0103.png"
        string_val: "../data/target/train_images/0104.png"
        string_val: "../data/target/train_images/0105.png"
        string_val: "../data/target/train_images/0106.png"
        string_val: "../data/target/train_images/0107.png"
        string_val: "../data/target/train_images/0108.png"
        string_val: "../data/target/train_images/0109.png"
        string_val: "../data/target/train_images/0110.png"
        string_val: "../data/target/train_images/0111.png"
        string_val: "../data/target/train_images/0112.png"
        string_val: "../data/target/train_images/0113.png"
        string_val: "../data/target/train_images/0114.png"
        string_val: "../data/target/train_images/0115.png"
        string_val: "../data/target/train_images/0116.png"
        string_val: "../data/target/train_images/0117.png"
        string_val: "../data/target/train_images/0118.png"
        string_val: "../data/target/train_images/0119.png"
        string_val: "../data/target/train_images/0120.png"
        string_val: "../data/target/train_images/0121.png"
        string_val: "../data/target/train_images/0122.png"
        string_val: "../data/target/train_images/0123.png"
        string_val: "../data/target/train_images/0124.png"
        string_val: "../data/target/train_images/0125.png"
        string_val: "../data/target/train_images/0126.png"
        string_val: "../data/target/train_images/0127.png"
        string_val: "../data/target/train_images/0128.png"
        string_val: "../data/target/train_images/0129.png"
        string_val: "../data/target/train_images/0130.png"
        string_val: "../data/target/train_images/0131.png"
        string_val: "../data/target/train_images/0132.png"
        string_val: "../data/target/train_images/0133.png"
        string_val: "../data/target/train_images/0134.png"
        string_val: "../data/target/train_images/0135.png"
        string_val: "../data/target/train_images/0136.png"
        string_val: "../data/target/train_images/0137.png"
        string_val: "../data/target/train_images/0138.png"
        string_val: "../data/target/train_images/0139.png"
        string_val: "../data/target/train_images/0140.png"
        string_val: "../data/target/train_images/0141.png"
        string_val: "../data/target/train_images/0142.png"
        string_val: "../data/target/train_images/0143.png"
        string_val: "../data/target/train_images/0144.png"
        string_val: "../data/target/train_images/0145.png"
        string_val: "../data/target/train_images/0146.png"
        string_val: "../data/target/train_images/0147.png"
        string_val: "../data/target/train_images/0148.png"
        string_val: "../data/target/train_images/0149.png"
        string_val: "../data/target/train_images/0150.png"
        string_val: "../data/target/train_images/0151.png"
        string_val: "../data/target/train_images/0152.png"
        string_val: "../data/target/train_images/0153.png"
        string_val: "../data/target/train_images/0154.png"
        string_val: "../data/target/train_images/0155.png"
        string_val: "../data/target/train_images/0156.png"
        string_val: "../data/target/train_images/0157.png"
        string_val: "../data/target/train_images/0158.png"
        string_val: "../data/target/train_images/0159.png"
        string_val: "../data/target/train_images/0160.png"
        string_val: "../data/target/train_images/0161.png"
        string_val: "../data/target/train_images/0162.png"
        string_val: "../data/target/train_images/0163.png"
        string_val: "../data/target/train_images/0164.png"
        string_val: "../data/target/train_images/0165.png"
        string_val: "../data/target/train_images/0166.png"
        string_val: "../data/target/train_images/0167.png"
        string_val: "../data/target/train_images/0168.png"
        string_val: "../data/target/train_images/0169.png"
        string_val: "../data/target/train_images/0170.png"
        string_val: "../data/target/train_images/0171.png"
        string_val: "../data/target/train_images/0172.png"
        string_val: "../data/target/train_images/0173.png"
        string_val: "../data/target/train_images/0174.png"
        string_val: "../data/target/train_images/0175.png"
        string_val: "../data/target/train_images/0176.png"
        string_val: "../data/target/train_images/0177.png"
        string_val: "../data/target/train_images/0178.png"
        string_val: "../data/target/train_images/0179.png"
        string_val: "../data/target/train_images/0180.png"
        string_val: "../data/target/train_images/0181.png"
        string_val: "../data/target/train_images/0182.png"
        string_val: "../data/target/train_images/0183.png"
        string_val: "../data/target/train_images/0184.png"
        string_val: "../data/target/train_images/0185.png"
        string_val: "../data/target/train_images/0186.png"
        string_val: "../data/target/train_images/0187.png"
        string_val: "../data/target/train_images/0188.png"
        string_val: "../data/target/train_images/0189.png"
        string_val: "../data/target/train_images/0190.png"
        string_val: "../data/target/train_images/0191.png"
        string_val: "../data/target/train_images/0192.png"
        string_val: "../data/target/train_images/0193.png"
        string_val: "../data/target/train_images/0194.png"
        string_val: "../data/target/train_images/0195.png"
        string_val: "../data/target/train_images/0196.png"
        string_val: "../data/target/train_images/0197.png"
        string_val: "../data/target/train_images/0198.png"
        string_val: "../data/target/train_images/0199.png"
        string_val: "../data/target/train_images/0200.png"
        string_val: "../data/target/train_images/0201.png"
        string_val: "../data/target/train_images/0202.png"
        string_val: "../data/target/train_images/0203.png"
        string_val: "../data/target/train_images/0204.png"
        string_val: "../data/target/train_images/0205.png"
        string_val: "../data/target/train_images/0206.png"
        string_val: "../data/target/train_images/0207.png"
        string_val: "../data/target/train_images/0208.png"
        string_val: "../data/target/train_images/0209.png"
        string_val: "../data/target/train_images/0210.png"
        string_val: "../data/target/train_images/0211.png"
        string_val: "../data/target/train_images/0212.png"
        string_val: "../data/target/train_images/0213.png"
        string_val: "../data/target/train_images/0214.png"
        string_val: "../data/target/train_images/0215.png"
        string_val: "../data/target/train_images/0216.png"
        string_val: "../data/target/train_images/0217.png"
        string_val: "../data/target/train_images/0218.png"
        string_val: "../data/target/train_images/0219.png"
        string_val: "../data/target/train_images/0220.png"
        string_val: "../data/target/train_images/0221.png"
        string_val: "../data/target/train_images/0222.png"
        string_val: "../data/target/train_images/0223.png"
        string_val: "../data/target/train_images/0224.png"
        string_val: "../data/target/train_images/0225.png"
        string_val: "../data/target/train_images/0226.png"
        string_val: "../data/target/train_images/0227.png"
        string_val: "../data/target/train_images/0228.png"
        string_val: "../data/target/train_images/0229.png"
        string_val: "../data/target/train_images/0230.png"
        string_val: "../data/target/train_images/0231.png"
        string_val: "../data/target/train_images/0232.png"
        string_val: "../data/target/train_images/0233.png"
        string_val: "../data/target/train_images/0234.png"
        string_val: "../data/target/train_images/0235.png"
        string_val: "../data/target/train_images/0236.png"
        string_val: "../data/target/train_images/0237.png"
        string_val: "../data/target/train_images/0238.png"
        string_val: "../data/target/train_images/0239.png"
        string_val: "../data/target/train_images/0240.png"
        string_val: "../data/target/train_images/0241.png"
        string_val: "../data/target/train_images/0242.png"
        string_val: "../data/target/train_images/0243.png"
        string_val: "../data/target/train_images/0244.png"
        string_val: "../data/target/train_images/0245.png"
        string_val: "../data/target/train_images/0246.png"
        string_val: "../data/target/train_images/0247.png"
        string_val: "../data/target/train_images/0248.png"
        string_val: "../data/target/train_images/0249.png"
        string_val: "../data/target/train_images/0250.png"
        string_val: "../data/target/train_images/0251.png"
        string_val: "../data/target/train_images/0252.png"
        string_val: "../data/target/train_images/0253.png"
        string_val: "../data/target/train_images/0254.png"
        string_val: "../data/target/train_images/0255.png"
        string_val: "../data/target/train_images/0256.png"
        string_val: "../data/target/train_images/0257.png"
        string_val: "../data/target/train_images/0258.png"
        string_val: "../data/target/train_images/0259.png"
        string_val: "../data/target/train_images/0260.png"
        string_val: "../data/target/train_images/0261.png"
        string_val: "../data/target/train_images/0262.png"
        string_val: "../data/target/train_images/0263.png"
        string_val: "../data/target/train_images/0264.png"
        string_val: "../data/target/train_images/0265.png"
        string_val: "../data/target/train_images/0266.png"
        string_val: "../data/target/train_images/0267.png"
        string_val: "../data/target/train_images/0268.png"
        string_val: "../data/target/train_images/0269.png"
        string_val: "../data/target/train_images/0270.png"
        string_val: "../data/target/train_images/0271.png"
        string_val: "../data/target/train_images/0272.png"
        string_val: "../data/target/train_images/0273.png"
        string_val: "../data/target/train_images/0274.png"
        string_val: "../data/target/train_images/0275.png"
        string_val: "../data/target/train_images/0276.png"
        string_val: "../data/target/train_images/0277.png"
        string_val: "../data/target/train_images/0278.png"
        string_val: "../data/target/train_images/0279.png"
        string_val: "../data/target/train_images/0280.png"
        string_val: "../data/target/train_images/0281.png"
        string_val: "../data/target/train_images/0282.png"
        string_val: "../data/target/train_images/0283.png"
        string_val: "../data/target/train_images/0284.png"
        string_val: "../data/target/train_images/0285.png"
        string_val: "../data/target/train_images/0286.png"
        string_val: "../data/target/train_images/0287.png"
        string_val: "../data/target/train_images/0288.png"
        string_val: "../data/target/train_images/0289.png"
        string_val: "../data/target/train_images/0290.png"
        string_val: "../data/target/train_images/0291.png"
        string_val: "../data/target/train_images/0292.png"
        string_val: "../data/target/train_images/0293.png"
        string_val: "../data/target/train_images/0294.png"
        string_val: "../data/target/train_images/0295.png"
        string_val: "../data/target/train_images/0296.png"
        string_val: "../data/target/train_images/0297.png"
        string_val: "../data/target/train_images/0298.png"
        string_val: "../data/target/train_images/0299.png"
        string_val: "../data/target/train_images/0300.png"
        string_val: "../data/target/train_images/0301.png"
        string_val: "../data/target/train_images/0302.png"
        string_val: "../data/target/train_images/0303.png"
        string_val: "../data/target/train_images/0304.png"
        string_val: "../data/target/train_images/0305.png"
        string_val: "../data/target/train_images/0306.png"
        string_val: "../data/target/train_images/0307.png"
        string_val: "../data/target/train_images/0308.png"
        string_val: "../data/target/train_images/0309.png"
        string_val: "../data/target/train_images/0310.png"
        string_val: "../data/target/train_images/0311.png"
        string_val: "../data/target/train_images/0312.png"
        string_val: "../data/target/train_images/0313.png"
        string_val: "../data/target/train_images/0314.png"
        string_val: "../data/target/train_images/0315.png"
        string_val: "../data/target/train_images/0316.png"
        string_val: "../data/target/train_images/0317.png"
        string_val: "../data/target/train_images/0318.png"
        string_val: "../data/target/train_images/0319.png"
        string_val: "../data/target/train_images/0320.png"
        string_val: "../data/target/train_images/0321.png"
        string_val: "../data/target/train_images/0322.png"
        string_val: "../data/target/train_images/0323.png"
        string_val: "../data/target/train_images/0324.png"
        string_val: "../data/target/train_images/0325.png"
        string_val: "../data/target/train_images/0326.png"
        string_val: "../data/target/train_images/0327.png"
        string_val: "../data/target/train_images/0328.png"
        string_val: "../data/target/train_images/0329.png"
        string_val: "../data/target/train_images/0330.png"
        string_val: "../data/target/train_images/0331.png"
        string_val: "../data/target/train_images/0332.png"
        string_val: "../data/target/train_images/0333.png"
        string_val: "../data/target/train_images/0334.png"
        string_val: "../data/target/train_images/0335.png"
        string_val: "../data/target/train_images/0336.png"
        string_val: "../data/target/train_images/0337.png"
        string_val: "../data/target/train_images/0338.png"
        string_val: "../data/target/train_images/0339.png"
        string_val: "../data/target/train_images/0340.png"
        string_val: "../data/target/train_images/0341.png"
        string_val: "../data/target/train_images/0342.png"
        string_val: "../data/target/train_images/0343.png"
        string_val: "../data/target/train_images/0344.png"
        string_val: "../data/target/train_images/0345.png"
        string_val: "../data/target/train_images/0346.png"
        string_val: "../data/target/train_images/0347.png"
        string_val: "../data/target/train_images/0348.png"
        string_val: "../data/target/train_images/0349.png"
        string_val: "../data/target/train_images/0350.png"
        string_val: "../data/target/train_images/0351.png"
        string_val: "../data/target/train_images/0352.png"
        string_val: "../data/target/train_images/0353.png"
        string_val: "../data/target/train_images/0354.png"
        string_val: "../data/target/train_images/0355.png"
        string_val: "../data/target/train_images/0356.png"
        string_val: "../data/target/train_images/0357.png"
        string_val: "../data/target/train_images/0358.png"
        string_val: "../data/target/train_images/0359.png"
        string_val: "../data/target/train_images/0360.png"
        string_val: "../data/target/train_images/0361.png"
        string_val: "../data/target/train_images/0362.png"
        string_val: "../data/target/train_images/0363.png"
        string_val: "../data/target/train_images/0364.png"
        string_val: "../data/target/train_images/0365.png"
        string_val: "../data/target/train_images/0366.png"
        string_val: "../data/target/train_images/0367.png"
        string_val: "../data/target/train_images/0368.png"
        string_val: "../data/target/train_images/0369.png"
        string_val: "../data/target/train_images/0370.png"
        string_val: "../data/target/train_images/0371.png"
        string_val: "../data/target/train_images/0372.png"
        string_val: "../data/target/train_images/0373.png"
        string_val: "../data/target/train_images/0374.png"
        string_val: "../data/target/train_images/0375.png"
        string_val: "../data/target/train_images/0376.png"
        string_val: "../data/target/train_images/0377.png"
        string_val: "../data/target/train_images/0378.png"
        string_val: "../data/target/train_images/0379.png"
        string_val: "../data/target/train_images/0380.png"
        string_val: "../data/target/train_images/0381.png"
        string_val: "../data/target/train_images/0382.png"
        string_val: "../data/target/train_images/0383.png"
        string_val: "../data/target/train_images/0384.png"
        string_val: "../data/target/train_images/0385.png"
        string_val: "../data/target/train_images/0386.png"
        string_val: "../data/target/train_images/0387.png"
        string_val: "../data/target/train_images/0388.png"
        string_val: "../data/target/train_images/0389.png"
        string_val: "../data/target/train_images/0390.png"
        string_val: "../data/target/train_images/0391.png"
        string_val: "../data/target/train_images/0392.png"
        string_val: "../data/target/train_images/0393.png"
        string_val: "../data/target/train_images/0394.png"
        string_val: "../data/target/train_images/0395.png"
        string_val: "../data/target/train_images/0396.png"
        string_val: "../data/target/train_images/0397.png"
        string_val: "../data/target/train_images/0398.png"
        string_val: "../data/target/train_images/0399.png"
        string_val: "../data/target/train_images/0400.png"
        string_val: "../data/target/train_images/0401.png"
        string_val: "../data/target/train_images/0402.png"
        string_val: "../data/target/train_images/0403.png"
        string_val: "../data/target/train_images/0404.png"
        string_val: "../data/target/train_images/0405.png"
        string_val: "../data/target/train_images/0406.png"
        string_val: "../data/target/train_images/0407.png"
        string_val: "../data/target/train_images/0408.png"
        string_val: "../data/target/train_images/0409.png"
        string_val: "../data/target/train_images/0410.png"
        string_val: "../data/target/train_images/0411.png"
        string_val: "../data/target/train_images/0412.png"
        string_val: "../data/target/train_images/0413.png"
        string_val: "../data/target/train_images/0414.png"
        string_val: "../data/target/train_images/0415.png"
        string_val: "../data/target/train_images/0416.png"
        string_val: "../data/target/train_images/0417.png"
        string_val: "../data/target/train_images/0418.png"
        string_val: "../data/target/train_images/0419.png"
        string_val: "../data/target/train_images/0420.png"
        string_val: "../data/target/train_images/0421.png"
        string_val: "../data/target/train_images/0422.png"
        string_val: "../data/target/train_images/0423.png"
        string_val: "../data/target/train_images/0424.png"
        string_val: "../data/target/train_images/0425.png"
        string_val: "../data/target/train_images/0426.png"
        string_val: "../data/target/train_images/0427.png"
        string_val: "../data/target/train_images/0428.png"
        string_val: "../data/target/train_images/0429.png"
        string_val: "../data/target/train_images/0430.png"
        string_val: "../data/target/train_images/0431.png"
        string_val: "../data/target/train_images/0432.png"
        string_val: "../data/target/train_images/0433.png"
        string_val: "../data/target/train_images/0434.png"
        string_val: "../data/target/train_images/0435.png"
        string_val: "../data/target/train_images/0436.png"
        string_val: "../data/target/train_images/0437.png"
        string_val: "../data/target/train_images/0438.png"
        string_val: "../data/target/train_images/0439.png"
        string_val: "../data/target/train_images/0440.png"
        string_val: "../data/target/train_images/0441.png"
        string_val: "../data/target/train_images/0442.png"
        string_val: "../data/target/train_images/0443.png"
        string_val: "../data/target/train_images/0444.png"
        string_val: "../data/target/train_images/0445.png"
        string_val: "../data/target/train_images/0446.png"
        string_val: "../data/target/train_images/0447.png"
        string_val: "../data/target/train_images/0448.png"
        string_val: "../data/target/train_images/0449.png"
        string_val: "../data/target/train_images/0450.png"
        string_val: "../data/target/train_images/0451.png"
        string_val: "../data/target/train_images/0452.png"
        string_val: "../data/target/train_images/0453.png"
        string_val: "../data/target/train_images/0454.png"
        string_val: "../data/target/train_images/0455.png"
        string_val: "../data/target/train_images/0456.png"
        string_val: "../data/target/train_images/0457.png"
        string_val: "../data/target/train_images/0458.png"
        string_val: "../data/target/train_images/0459.png"
        string_val: "../data/target/train_images/0460.png"
        string_val: "../data/target/train_images/0461.png"
        string_val: "../data/target/train_images/0462.png"
        string_val: "../data/target/train_images/0463.png"
        string_val: "../data/target/train_images/0464.png"
        string_val: "../data/target/train_images/0465.png"
        string_val: "../data/target/train_images/0466.png"
        string_val: "../data/target/train_images/0467.png"
        string_val: "../data/target/train_images/0468.png"
        string_val: "../data/target/train_images/0469.png"
        string_val: "../data/target/train_images/0470.png"
        string_val: "../data/target/train_images/0471.png"
        string_val: "../data/target/train_images/0472.png"
        string_val: "../data/target/train_images/0473.png"
        string_val: "../data/target/train_images/0474.png"
        string_val: "../data/target/train_images/0475.png"
        string_val: "../data/target/train_images/0476.png"
        string_val: "../data/target/train_images/0477.png"
        string_val: "../data/target/train_images/0478.png"
        string_val: "../data/target/train_images/0479.png"
        string_val: "../data/target/train_images/0480.png"
        string_val: "../data/target/train_images/0481.png"
        string_val: "../data/target/train_images/0482.png"
        string_val: "../data/target/train_images/0483.png"
        string_val: "../data/target/train_images/0484.png"
        string_val: "../data/target/train_images/0485.png"
        string_val: "../data/target/train_images/0486.png"
        string_val: "../data/target/train_images/0487.png"
        string_val: "../data/target/train_images/0488.png"
        string_val: "../data/target/train_images/0489.png"
        string_val: "../data/target/train_images/0490.png"
        string_val: "../data/target/train_images/0491.png"
        string_val: "../data/target/train_images/0492.png"
        string_val: "../data/target/train_images/0493.png"
        string_val: "../data/target/train_images/0494.png"
        string_val: "../data/target/train_images/0495.png"
        string_val: "../data/target/train_images/0496.png"
        string_val: "../data/target/train_images/0497.png"
        string_val: "../data/target/train_images/0498.png"
        string_val: "../data/target/train_images/0499.png"
        string_val: "../data/target/train_images/0500.png"
        string_val: "../data/target/train_images/0501.png"
        string_val: "../data/target/train_images/0502.png"
        string_val: "../data/target/train_images/0503.png"
        string_val: "../data/target/train_images/0504.png"
        string_val: "../data/target/train_images/0505.png"
        string_val: "../data/target/train_images/0506.png"
        string_val: "../data/target/train_images/0507.png"
        string_val: "../data/target/train_images/0508.png"
        string_val: "../data/target/train_images/0509.png"
        string_val: "../data/target/train_images/0510.png"
        string_val: "../data/target/train_images/0511.png"
        string_val: "../data/target/train_images/0512.png"
        string_val: "../data/target/train_images/0513.png"
        string_val: "../data/target/train_images/0514.png"
        string_val: "../data/target/train_images/0515.png"
        string_val: "../data/target/train_images/0516.png"
        string_val: "../data/target/train_images/0517.png"
        string_val: "../data/target/train_images/0518.png"
        string_val: "../data/target/train_images/0519.png"
        string_val: "../data/target/train_images/0520.png"
        string_val: "../data/target/train_images/0521.png"
        string_val: "../data/target/train_images/0522.png"
        string_val: "../data/target/train_images/0523.png"
        string_val: "../data/target/train_images/0524.png"
        string_val: "../data/target/train_images/0525.png"
        string_val: "../data/target/train_images/0526.png"
        string_val: "../data/target/train_images/0527.png"
        string_val: "../data/target/train_images/0528.png"
        string_val: "../data/target/train_images/0529.png"
        string_val: "../data/target/train_images/0530.png"
        string_val: "../data/target/train_images/0531.png"
        string_val: "../data/target/train_images/0532.png"
        string_val: "../data/target/train_images/0533.png"
        string_val: "../data/target/train_images/0534.png"
        string_val: "../data/target/train_images/0535.png"
        string_val: "../data/target/train_images/0536.png"
        string_val: "../data/target/train_images/0537.png"
        string_val: "../data/target/train_images/0538.png"
        string_val: "../data/target/train_images/0539.png"
        string_val: "../data/target/train_images/0540.png"
        string_val: "../data/target/train_images/0541.png"
        string_val: "../data/target/train_images/0542.png"
        string_val: "../data/target/train_images/0543.png"
        string_val: "../data/target/train_images/0544.png"
        string_val: "../data/target/train_images/0545.png"
        string_val: "../data/target/train_images/0546.png"
        string_val: "../data/target/train_images/0547.png"
        string_val: "../data/target/train_images/0548.png"
        string_val: "../data/target/train_images/0549.png"
        string_val: "../data/target/train_images/0550.png"
        string_val: "../data/target/train_images/0551.png"
        string_val: "../data/target/train_images/0552.png"
        string_val: "../data/target/train_images/0553.png"
        string_val: "../data/target/train_images/0554.png"
        string_val: "../data/target/train_images/0555.png"
        string_val: "../data/target/train_images/0556.png"
        string_val: "../data/target/train_images/0557.png"
        string_val: "../data/target/train_images/0558.png"
        string_val: "../data/target/train_images/0559.png"
        string_val: "../data/target/train_images/0560.png"
        string_val: "../data/target/train_images/0561.png"
        string_val: "../data/target/train_images/0562.png"
        string_val: "../data/target/train_images/0563.png"
        string_val: "../data/target/train_images/0564.png"
        string_val: "../data/target/train_images/0565.png"
        string_val: "../data/target/train_images/0566.png"
        string_val: "../data/target/train_images/0567.png"
        string_val: "../data/target/train_images/0568.png"
        string_val: "../data/target/train_images/0569.png"
        string_val: "../data/target/train_images/0570.png"
        string_val: "../data/target/train_images/0571.png"
        string_val: "../data/target/train_images/0572.png"
        string_val: "../data/target/train_images/0573.png"
        string_val: "../data/target/train_images/0574.png"
        string_val: "../data/target/train_images/0575.png"
        string_val: "../data/target/train_images/0576.png"
        string_val: "../data/target/train_images/0577.png"
        string_val: "../data/target/train_images/0578.png"
        string_val: "../data/target/train_images/0579.png"
        string_val: "../data/target/train_images/0580.png"
        string_val: "../data/target/train_images/0581.png"
        string_val: "../data/target/train_images/0582.png"
        string_val: "../data/target/train_images/0583.png"
        string_val: "../data/target/train_images/0584.png"
        string_val: "../data/target/train_images/0585.png"
        string_val: "../data/target/train_images/0586.png"
        string_val: "../data/target/train_images/0587.png"
        string_val: "../data/target/train_images/0588.png"
        string_val: "../data/target/train_images/0589.png"
        string_val: "../data/target/train_images/0590.png"
        string_val: "../data/target/train_images/0591.png"
        string_val: "../data/target/train_images/0592.png"
        string_val: "../data/target/train_images/0593.png"
        string_val: "../data/target/train_images/0594.png"
        string_val: "../data/target/train_images/0595.png"
        string_val: "../data/target/train_images/0596.png"
        string_val: "../data/target/train_images/0597.png"
        string_val: "../data/target/train_images/0598.png"
        string_val: "../data/target/train_images/0599.png"
        string_val: "../data/target/train_images/0600.png"
        string_val: "../data/target/train_images/0601.png"
        string_val: "../data/target/train_images/0602.png"
        string_val: "../data/target/train_images/0603.png"
        string_val: "../data/target/train_images/0604.png"
        string_val: "../data/target/train_images/0605.png"
        string_val: "../data/target/train_images/0606.png"
        string_val: "../data/target/train_images/0607.png"
        string_val: "../data/target/train_images/0608.png"
        string_val: "../data/target/train_images/0609.png"
        string_val: "../data/target/train_images/0610.png"
        string_val: "../data/target/train_images/0611.png"
        string_val: "../data/target/train_images/0612.png"
        string_val: "../data/target/train_images/0613.png"
        string_val: "../data/target/train_images/0614.png"
        string_val: "../data/target/train_images/0615.png"
        string_val: "../data/target/train_images/0616.png"
        string_val: "../data/target/train_images/0617.png"
        string_val: "../data/target/train_images/0618.png"
        string_val: "../data/target/train_images/0619.png"
        string_val: "../data/target/train_images/0620.png"
        string_val: "../data/target/train_images/0621.png"
        string_val: "../data/target/train_images/0622.png"
        string_val: "../data/target/train_images/0623.png"
        string_val: "../data/target/train_images/0624.png"
        string_val: "../data/target/train_images/0625.png"
        string_val: "../data/target/train_images/0626.png"
        string_val: "../data/target/train_images/0627.png"
        string_val: "../data/target/train_images/0628.png"
        string_val: "../data/target/train_images/0629.png"
        string_val: "../data/target/train_images/0630.png"
        string_val: "../data/target/train_images/0631.png"
        string_val: "../data/target/train_images/0632.png"
        string_val: "../data/target/train_images/0633.png"
        string_val: "../data/target/train_images/0634.png"
        string_val: "../data/target/train_images/0635.png"
        string_val: "../data/target/train_images/0636.png"
        string_val: "../data/target/train_images/0637.png"
        string_val: "../data/target/train_images/0638.png"
        string_val: "../data/target/train_images/0639.png"
        string_val: "../data/target/train_images/0640.png"
        string_val: "../data/target/train_images/0641.png"
        string_val: "../data/target/train_images/0642.png"
        string_val: "../data/target/train_images/0643.png"
        string_val: "../data/target/train_images/0644.png"
        string_val: "../data/target/train_images/0645.png"
        string_val: "../data/target/train_images/0646.png"
        string_val: "../data/target/train_images/0647.png"
        string_val: "../data/target/train_images/0648.png"
        string_val: "../data/target/train_images/0649.png"
        string_val: "../data/target/train_images/0650.png"
        string_val: "../data/target/train_images/0651.png"
        string_val: "../data/target/train_images/0652.png"
        string_val: "../data/target/train_images/0653.png"
        string_val: "../data/target/train_images/0654.png"
        string_val: "../data/target/train_images/0655.png"
        string_val: "../data/target/train_images/0656.png"
        string_val: "../data/target/train_images/0657.png"
        string_val: "../data/target/train_images/0658.png"
        string_val: "../data/target/train_images/0659.png"
        string_val: "../data/target/train_images/0660.png"
        string_val: "../data/target/train_images/0661.png"
        string_val: "../data/target/train_images/0662.png"
        string_val: "../data/target/train_images/0663.png"
        string_val: "../data/target/train_images/0664.png"
        string_val: "../data/target/train_images/0665.png"
        string_val: "../data/target/train_images/0666.png"
        string_val: "../data/target/train_images/0667.png"
        string_val: "../data/target/train_images/0668.png"
        string_val: "../data/target/train_images/0669.png"
        string_val: "../data/target/train_images/0670.png"
        string_val: "../data/target/train_images/0671.png"
        string_val: "../data/target/train_images/0672.png"
        string_val: "../data/target/train_images/0673.png"
        string_val: "../data/target/train_images/0674.png"
        string_val: "../data/target/train_images/0675.png"
        string_val: "../data/target/train_images/0676.png"
        string_val: "../data/target/train_images/0677.png"
        string_val: "../data/target/train_images/0678.png"
        string_val: "../data/target/train_images/0679.png"
        string_val: "../data/target/train_images/0680.png"
        string_val: "../data/target/train_images/0681.png"
        string_val: "../data/target/train_images/0682.png"
        string_val: "../data/target/train_images/0683.png"
        string_val: "../data/target/train_images/0684.png"
        string_val: "../data/target/train_images/0685.png"
        string_val: "../data/target/train_images/0686.png"
        string_val: "../data/target/train_images/0687.png"
        string_val: "../data/target/train_images/0688.png"
        string_val: "../data/target/train_images/0689.png"
        string_val: "../data/target/train_images/0690.png"
        string_val: "../data/target/train_images/0691.png"
        string_val: "../data/target/train_images/0692.png"
        string_val: "../data/target/train_images/0693.png"
        string_val: "../data/target/train_images/0694.png"
        string_val: "../data/target/train_images/0695.png"
        string_val: "../data/target/train_images/0696.png"
        string_val: "../data/target/train_images/0697.png"
        string_val: "../data/target/train_images/0698.png"
        string_val: "../data/target/train_images/0699.png"
        string_val: "../data/target/train_images/0700.png"
        string_val: "../data/target/train_images/0701.png"
        string_val: "../data/target/train_images/0702.png"
        string_val: "../data/target/train_images/0703.png"
        string_val: "../data/target/train_images/0704.png"
        string_val: "../data/target/train_images/0705.png"
        string_val: "../data/target/train_images/0706.png"
        string_val: "../data/target/train_images/0707.png"
        string_val: "../data/target/train_images/0708.png"
        string_val: "../data/target/train_images/0709.png"
        string_val: "../data/target/train_images/0710.png"
        string_val: "../data/target/train_images/0711.png"
        string_val: "../data/target/train_images/0712.png"
        string_val: "../data/target/train_images/0713.png"
        string_val: "../data/target/train_images/0714.png"
        string_val: "../data/target/train_images/0715.png"
        string_val: "../data/target/train_images/0716.png"
        string_val: "../data/target/train_images/0717.png"
        string_val: "../data/target/train_images/0718.png"
        string_val: "../data/target/train_images/0719.png"
        string_val: "../data/target/train_images/0720.png"
        string_val: "../data/target/train_images/0721.png"
        string_val: "../data/target/train_images/0722.png"
        string_val: "../data/target/train_images/0723.png"
        string_val: "../data/target/train_images/0724.png"
        string_val: "../data/target/train_images/0725.png"
        string_val: "../data/target/train_images/0726.png"
        string_val: "../data/target/train_images/0727.png"
        string_val: "../data/target/train_images/0728.png"
        string_val: "../data/target/train_images/0729.png"
        string_val: "../data/target/train_images/0730.png"
        string_val: "../data/target/train_images/0731.png"
        string_val: "../data/target/train_images/0732.png"
        string_val: "../data/target/train_images/0733.png"
        string_val: "../data/target/train_images/0734.png"
        string_val: "../data/target/train_images/0735.png"
        string_val: "../data/target/train_images/0736.png"
        string_val: "../data/target/train_images/0737.png"
        string_val: "../data/target/train_images/0738.png"
        string_val: "../data/target/train_images/0739.png"
        string_val: "../data/target/train_images/0740.png"
        string_val: "../data/target/train_images/0741.png"
        string_val: "../data/target/train_images/0742.png"
        string_val: "../data/target/train_images/0743.png"
        string_val: "../data/target/train_images/0744.png"
        string_val: "../data/target/train_images/0745.png"
        string_val: "../data/target/train_images/0746.png"
        string_val: "../data/target/train_images/0747.png"
        string_val: "../data/target/train_images/0748.png"
        string_val: "../data/target/train_images/0749.png"
        string_val: "../data/target/train_images/0750.png"
        string_val: "../data/target/train_images/0751.png"
        string_val: "../data/target/train_images/0752.png"
        string_val: "../data/target/train_images/0753.png"
        string_val: "../data/target/train_images/0754.png"
        string_val: "../data/target/train_images/0755.png"
        string_val: "../data/target/train_images/0756.png"
        string_val: "../data/target/train_images/0757.png"
        string_val: "../data/target/train_images/0758.png"
        string_val: "../data/target/train_images/0759.png"
        string_val: "../data/target/train_images/0760.png"
        string_val: "../data/target/train_images/0761.png"
        string_val: "../data/target/train_images/0762.png"
        string_val: "../data/target/train_images/0763.png"
        string_val: "../data/target/train_images/0764.png"
        string_val: "../data/target/train_images/0765.png"
        string_val: "../data/target/train_images/0766.png"
        string_val: "../data/target/train_images/0767.png"
        string_val: "../data/target/train_images/0768.png"
        string_val: "../data/target/train_images/0769.png"
        string_val: "../data/target/train_images/0770.png"
        string_val: "../data/target/train_images/0771.png"
        string_val: "../data/target/train_images/0772.png"
        string_val: "../data/target/train_images/0773.png"
        string_val: "../data/target/train_images/0774.png"
        string_val: "../data/target/train_images/0775.png"
        string_val: "../data/target/train_images/0776.png"
        string_val: "../data/target/train_images/0777.png"
        string_val: "../data/target/train_images/0778.png"
        string_val: "../data/target/train_images/0779.png"
        string_val: "../data/target/train_images/0780.png"
        string_val: "../data/target/train_images/0781.png"
        string_val: "../data/target/train_images/0782.png"
        string_val: "../data/target/train_images/0783.png"
        string_val: "../data/target/train_images/0784.png"
        string_val: "../data/target/train_images/0785.png"
        string_val: "../data/target/train_images/0786.png"
        string_val: "../data/target/train_images/0787.png"
        string_val: "../data/target/train_images/0788.png"
        string_val: "../data/target/train_images/0789.png"
        string_val: "../data/target/train_images/0790.png"
        string_val: "../data/target/train_images/0791.png"
        string_val: "../data/target/train_images/0792.png"
        string_val: "../data/target/train_images/0793.png"
        string_val: "../data/target/train_images/0794.png"
        string_val: "../data/target/train_images/0795.png"
        string_val: "../data/target/train_images/0796.png"
        string_val: "../data/target/train_images/0797.png"
        string_val: "../data/target/train_images/0798.png"
        string_val: "../data/target/train_images/0799.png"
        string_val: "../data/target/train_images/0800.png"
        string_val: "../data/target/train_images/0801.png"
        string_val: "../data/target/train_images/0802.png"
        string_val: "../data/target/train_images/0803.png"
        string_val: "../data/target/train_images/0804.png"
        string_val: "../data/target/train_images/0805.png"
        string_val: "../data/target/train_images/0806.png"
        string_val: "../data/target/train_images/0807.png"
        string_val: "../data/target/train_images/0808.png"
        string_val: "../data/target/train_images/0809.png"
        string_val: "../data/target/train_images/0810.png"
        string_val: "../data/target/train_images/0811.png"
        string_val: "../data/target/train_images/0812.png"
        string_val: "../data/target/train_images/0813.png"
        string_val: "../data/target/train_images/0814.png"
        string_val: "../data/target/train_images/0815.png"
        string_val: "../data/target/train_images/0816.png"
        string_val: "../data/target/train_images/0817.png"
        string_val: "../data/target/train_images/0818.png"
        string_val: "../data/target/train_images/0819.png"
        string_val: "../data/target/train_images/0820.png"
        string_val: "../data/target/train_images/0821.png"
        string_val: "../data/target/train_images/0822.png"
        string_val: "../data/target/train_images/0823.png"
        string_val: "../data/target/train_images/0824.png"
        string_val: "../data/target/train_images/0825.png"
        string_val: "../data/target/train_images/0826.png"
        string_val: "../data/target/train_images/0827.png"
        string_val: "../data/target/train_images/0828.png"
        string_val: "../data/target/train_images/0829.png"
        string_val: "../data/target/train_images/0830.png"
        string_val: "../data/target/train_images/0831.png"
        string_val: "../data/target/train_images/0832.png"
        string_val: "../data/target/train_images/0833.png"
        string_val: "../data/target/train_images/0834.png"
        string_val: "../data/target/train_images/0835.png"
        string_val: "../data/target/train_images/0836.png"
        string_val: "../data/target/train_images/0837.png"
        string_val: "../data/target/train_images/0838.png"
